BadissDjafar/thunder_bg22/target_bgm220_explorer/drivers/emlib/em_i2c.c
  /* Explicitly ensure denominator is never zero. */
  if (denominator == 0) {
    EFM_ASSERT(0);
    return;
  }
  /* Perform integer division so that div is rounded up. */
  div = ((freqRef - (I2C_CR_MAX * freqScl) + denominator - 1)
         / denominator) - 1;
  EFM_ASSERT(div >= 0);
  EFM_ASSERT((uint32_t)div <= _I2C_CLKDIV_DIV_MASK);

  /* The clock divisor must be at least 1 in slave mode according to the reference */
  /* manual (in which case there is normally no need to set the bus frequency). */
  if ((i2c->CTRL & I2C_CTRL_SLAVE) && (div == 0)) {
    div = 1;
  }
  i2c->CLKDIV = (uint32_t)div;
}

/***************************************************************************//**
 * @brief
 *   Enable/disable I2C.
 *
 * @note
 *   After enabling the I2C (from being disabled), the I2C is in BUSY state.
 *
 * @param[in] i2c
 *   A pointer to the I2C peripheral register block.
 *
 * @param[in] enable
 *   True to enable counting, false to disable.
 ******************************************************************************/
void I2C_Enable(I2C_TypeDef *i2c, bool enable)
{
  EFM_ASSERT(I2C_REF_VALID(i2c));

#if defined (_I2C_EN_MASK)
  BUS_RegBitWrite(&(i2c->EN), _I2C_EN_EN_SHIFT, enable);
#else
  BUS_RegBitWrite(&(i2c->CTRL), _I2C_CTRL_EN_SHIFT, enable);
#endif
}

/***************************************************************************//**
 * @brief
 *   Initialize I2C.
 *
 * @param[in] i2c
 *   A pointer to the I2C peripheral register block.
 *
 * @param[in] init
 *   A pointer to the I2C initialization structure.
 ******************************************************************************/
void I2C_Init(I2C_TypeDef *i2c, const I2C_Init_TypeDef *init)
{
  EFM_ASSERT(I2C_REF_VALID(i2c));

  i2c->IEN = 0;
  I2C_IntClear(i2c, _I2C_IF_MASK);

  /* Set SLAVE select mode. */
  BUS_RegBitWrite(&(i2c->CTRL), _I2C_CTRL_SLAVE_SHIFT, init->master ? 0 : 1);

  I2C_BusFreqSet(i2c, init->refFreq, init->freq, init->clhr);

  I2C_Enable(i2c, init->enable);
}

/***************************************************************************//**
 * @brief
 *   Reset I2C to the same state that it was in after a hardware reset.
 *
 * @note
 *   The ROUTE register is NOT reset by this function to allow for
 *   centralized setup of this feature.
 *
 * @param[in] i2c
 *   A pointer to the I2C peripheral register block.
 ******************************************************************************/
void I2C_Reset(I2C_TypeDef *i2c)
{
  // Cancel ongoing operations and clear TX buffer
  i2c->CMD       = I2C_CMD_CLEARPC | I2C_CMD_CLEARTX | I2C_CMD_ABORT;
  i2c->CTRL      = _I2C_CTRL_RESETVALUE;
  i2c->CLKDIV    = _I2C_CLKDIV_RESETVALUE;
  i2c->SADDR     = _I2C_SADDR_RESETVALUE;
  i2c->SADDRMASK = _I2C_SADDRMASK_RESETVALUE;
  i2c->IEN       = _I2C_IEN_RESETVALUE;
#if defined (_I2C_EN_EN_MASK)
  i2c->EN      = _I2C_EN_RESETVALUE;
#endif

  // Empty received data buffer
  flushRx(i2c);
  I2C_IntClear(i2c, _I2C_IF_MASK);
  /* Do not reset the route register; setting should be done independently. */
}

// *****************************************************************************
/// @brief
///   Continue an initiated I2C transfer (single master mode only).
///
/// @details
///   This function is used repeatedly after a I2C_TransferInit() to
///   complete a transfer. It may be used in polled mode as the below example
///   shows:
/// @code{.c}
/// I2C_TransferReturn_TypeDef ret;
///
/// // Do a polled transfer
/// ret = I2C_TransferInit(I2C0, seq);
/// while (ret == i2cTransferInProgress)
/// {
///   ret = I2C_Transfer(I2C0);
/// }
/// @endcode
///  It may also be used in interrupt driven mode, where this function is invoked
///  from the interrupt handler. Notice that, if used in interrupt mode, NVIC
///  interrupts must be configured and enabled for the I2C bus used. I2C
///  peripheral specific interrupts are managed by this software.
///
/// @note
///   Only single master mode is supported.
///
/// @param[in] i2c
///   A pointer to the I2C peripheral register block.
///
/// @return
///   Returns status for an ongoing transfer.
///   @li #i2cTransferInProgress - indicates that transfer not finished.
///   @li #i2cTransferDone - transfer completed successfully.
///   @li otherwise some sort of error has occurred.
///
// *****************************************************************************
I2C_TransferReturn_TypeDef I2C_Transfer(I2C_TypeDef *i2c)
{
  uint32_t                tmp;
  uint32_t                pending;
  I2C_Transfer_TypeDef    *transfer;
  I2C_TransferSeq_TypeDef *seq;

  EFM_ASSERT(I2C_REF_VALID(i2c));

  /* Support up to 2 I2C buses. */
  if (i2c == I2C0) {
    transfer = i2cTransfer;
  }
#if (I2C_COUNT > 1)
  else if (i2c == I2C1) {
    transfer = i2cTransfer + 1;
  }
#endif
#if (I2C_COUNT > 2)
  else if (i2c == I2C2) {
    transfer = i2cTransfer + 2;
  }
#endif
  else {
    return i2cTransferUsageFault;
  }

  seq = transfer->seq;
  for (;; ) {
    pending = i2c->IF;

    /* If some sort of fault, abort transfer. */
    if (pending & I2C_IF_ERRORS) {
      if (pending & I2C_IF_ARBLOST) {
        /* If an arbitration fault, indicates either a slave device */
        /* not responding as expected, or other master which is not */
        /* supported by this software. */
        transfer->result = i2cTransferArbLost;
      } else if (pending & I2C_IF_BUSERR) {
        /* A bus error indicates a misplaced start or stop, which should */
        /* not occur in master mode controlled by this software. */
        transfer->result = i2cTransferBusErr;
      }

      /* Ifan error occurs, it is difficult to know */
      /* an exact cause and how to resolve. It will be up to a wrapper */
      /* to determine how to handle a fault/recovery if possible. */
      transfer->state = i2cStateDone;
      goto done;
    }

    switch (transfer->state) {
      /***************************************************/
      /* Send the first start+address (first byte if 10 bit). */
      /***************************************************/
      case i2cStateStartAddrSend:
        if (seq->flags & I2C_FLAG_10BIT_ADDR) {
          tmp = (((uint32_t)(seq->addr) >> 8) & 0x06) | 0xf0;

          /* In 10 bit address mode, the address following the first */
          /* start always indicates write. */
        } else {
          tmp = (uint32_t)(seq->addr) & 0xfe;

